# Define the shopping list structure with categories and subcategories
shopping_list = {
    "Продукти": {
        "Овочі та фрукти": ["Помідори", "Огірки", "Яблука", "Банани"],
        "Напої": ["Вода", "Соки", "Кава", "Чай", "Алкоголь"],
        "Молочні продукти та яйця": ["Молоко", "Йогурти", "Сир", "Яйця"],
        "М'ясо, риба та морепродукти": ["Курка", "Свинина", "Яловичина", "Риба", "Лосось", "Креветки"],
        "Хлібобулочні вироби": ["Хліб", "Булочки", "Печиво", "Тістечка"],
        "Сухі продукти та консерви": ["Макарони", "Рис", "Бобові", "Консерви"],
        "Закуски та солодощі": ["Чіпси", "Шоколад", "Горіхи", "Цукерки"]
    },
    "Для дому": {
        "Засоби для прибирання": [],
        "Паперові рушники": [],
        "Засоби для прання": [],
        "Меблі": [],
        "Посуд": []
    },
    "Здоров'я": {
        "Косметика": [],
        "Засоби гігієни": [],
        "Вітаміни": [],
        "Медичні товари": []
    },
    "Одяг": {
        "Верхній одяг": [],
        "Взуття": []
    },
    "Електроніка": {
        "Телефони": [],
        "Ноутбуки": []
    },
    "Іграшки": {
        "М'які іграшки": [],
        "Кубики": []
    },
    "Домашні тварини": {
        "Корм для тварин": [],
        "Засоби догляду": []
    },
    "Інші продукти": {
        "Дитячі товари": [],
        "Спеції": [],
        "Додаткові товари": []
    }
}
