# Define the initial structure of the shopping list with categories and subcategories
shopping_list = {
    "Продукти": {
        "Овочі": [],
        "Фрукти": [],
    },
    "Одяг": {
        "Верхній одяг": [],
        "Взуття": [],
    },
    "Електроніка": {
        "Телефони": [],
        "Ноутбуки": [],
    },
    "Іграшки": {
        "М'які іграшки": [],
        "Кубики": [],
    },
    "Для дому": {
        "Меблі": [],
        "Посуд": [],
    },
    "Здоров'я": {
        "Вітаміни": [],
        "Медичні товари": [],
    }
}
